package ru.breffi.lib.models

data class MessageData(
    /**
     * EventId. Поле определяет тип события. Должен быть ассоциирован с конкретной моделью. Пример: clm.session.
     */
    val eventId : String? = null,
    /**
     * UserId. Идентификатор пользователя, если таковой имеется. Пример: 71529FCA-3154-44F5-A462-66323E464F23
     */
    val userId : String? = null,
    /**
     * ct - CorrelationToken. Идентификатор цепочки действий.
     * Если события происходят одно за другим и выстраиваются в цепочку,
     * то при возникновении первого события (событие верхнего уровня) ему присваивается токен корреляции
     * и все дочернии события получают его. Так можно отследить
     * последовательность действий от верхнего уровня и ниже. Пример: 96529FCA-6666-44F5-A462-66323E464444.
     */
    val correlationToken : String? = null,
    /**
     * Уникальный идентификатор. Если в теле передается сущность у которой есть уникальный идентификатор
     * (например у сущности сессии есть sessionId), то он записывается в это поле. Пример: “32”
     */
    val id : String? = null,
    /**
     * cud - тип операции. Может быть “c” - create, “u” - update, “d” - delete.
     * Если передается сущность над которой выполнили операцию создания,
     * редактирования или удаления то заполняется этот параметр. Пример: “с”
     */
    val operationType : String? = null,
    val body : Any? = null,
    /**
     * DeviceId. Идентификатор устройства, если поддерживается устройством. Пример: FDF5DA02-419E-465E-ADA6-A26B87097627
     */
    val deviceId : String? = null,

    val location : LocationData? = null
)